'''
Требуется вычислить, сколько раз встречается некоторое число k в массиве list_1.
Найдите количество и выведите его.
'''
'''
list_1 = [1, 2, 4, 3, 5]
k = 3
count = 0

for i in range(0, len(list_1)):
    if list_1[i] == k:
        count+=1
print(count)
'''
'''Требуется найти в массиве list_1 самый близкий по величине элемент к заданному числу k и вывести его.'''

list_1 = [1, 2, 3, 4, 5]
k = 6

for i in range(0, len(list_1)):
    if list_1[i] == k:
        
print()



